In [1]:
pip install pandas

Requirement already satisfied: pandas in ./venv/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./venv/lib/python3.12/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in ./venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
#import os
#mysql_jar_path = os.path.abspath("mysql-connector-j-9.0.0.jar")
#print("Caminho completo do JAR:", mysql_jar_path)

In [3]:
import numpy as np
import pandas as pd
import matplotlib
import tensorflow as tf
import sklearn

2025-05-22 04:33:13.849451: I external/local_xla/xla/tsl/cuda/cudart_stub.cc:32] Could not find cuda drivers on your machine, GPU will not be used.
2025-05-22 04:33:13.970340: I external/local_xla/xla/tsl/cuda/cudart_stub.cc:32] Could not find cuda drivers on your machine, GPU will not be used.
2025-05-22 04:33:14.080123: E external/local_xla/xla/stream_executor/cuda/cuda_fft.cc:467] Unable to register cuFFT factory: Attempting to register factory for plugin cuFFT when one has already been registered
WARNING: All log messages before absl::InitializeLog() is called are written to STDERR
E0000 00:00:1747888394.161171    2904 cuda_dnn.cc:8579] Unable to register cuDNN factory: Attempting to register factory for plugin cuDNN when one has already been registered
E0000 00:00:1747888394.183244    2904 cuda_blas.cc:1407] Unable to register cuBLAS factory: Attempting to register factory for plugin cuBLAS when one has already been registered
W0000 00:00:1747888394.364601    2904 computation_placer.cc:177] computation placer already registered. Please check linkage and avoid linking the same target more than once.
W0000 00:00:1747888394.364634    2904 computation_placer.cc:177] computation placer already registered. Please check linkage and avoid linking the same target more than once.
W0000 00:00:1747888394.364636    2904 computation_placer.cc:177] computation placer already registered. Please check linkage and avoid linking the same target more than once.
W0000 00:00:1747888394.364638    2904 computation_placer.cc:177] computation placer already registered. Please check linkage and avoid linking the same target more than once.
2025-05-22 04:33:14.386928: I tensorflow/core/platform/cpu_feature_guard.cc:210] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.
To enable the following instructions: AVX2 FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.

In [4]:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, Dropout, LSTM
from sklearn.preprocessing import MinMaxScaler
import matplotlib.pyplot as plt
from pyspark.sql import SparkSession
from pyspark.ml.regression import LinearRegression, RandomForestRegressor
from pyspark.ml.feature import VectorAssembler
import pandas as pd
from pyspark.ml.evaluation import RegressionEvaluator
from pyspark.sql.functions import col, sum

In [5]:
pip install yfinance

Requirement already satisfied: yfinance in ./venv/lib/python3.12/site-packages (0.2.61)
Requirement already satisfied: pandas>=1.3.0 in ./venv/lib/python3.12/site-packages (from yfinance) (2.2.3)
Requirement already satisfied: numpy>=1.16.5 in ./venv/lib/python3.12/site-packages (from yfinance) (2.1.3)
Requirement already satisfied: requests>=2.31 in ./venv/lib/python3.12/site-packages (from yfinance) (2.32.3)
Requirement already satisfied: multitasking>=0.0.7 in ./venv/lib/python3.12/site-packages (from yfinance) (0.0.11)
Requirement already satisfied: platformdirs>=2.0.0 in ./venv/lib/python3.12/site-packages (from yfinance) (4.3.8)
Requirement already satisfied: pytz>=2022.5 in ./venv/lib/python3.12/site-packages (from yfinance) (2025.2)
Requirement already satisfied: frozendict>=2.3.4 in ./venv/lib/python3.12/site-packages (from yfinance) (2.4.6)
Requirement already satisfied: peewee>=3.16.2 in ./venv/lib/python3.12/site-packages (from yfinance) (3.18.1)
Requirement already satisfied: beautifulsoup4>=4.11.1 in ./venv/lib/python3.12/site-packages (from yfinance) (4.13.4)
Requirement already satisfied: curl_cffi>=0.7 in ./venv/lib/python3.12/site-packages (from yfinance) (0.11.1)
Requirement already satisfied: protobuf>=3.19.0 in ./venv/lib/python3.12/site-packages (from yfinance) (5.29.4)
Requirement already satisfied: websockets>=13.0 in ./venv/lib/python3.12/site-packages (from yfinance) (15.0.1)
Requirement already satisfied: soupsieve>1.2 in ./venv/lib/python3.12/site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.7)
Requirement already satisfied: typing-extensions>=4.0.0 in ./venv/lib/python3.12/site-packages (from beautifulsoup4>=4.11.1->yfinance) (4.13.2)
Requirement already satisfied: cffi>=1.12.0 in ./venv/lib/python3.12/site-packages (from curl_cffi>=0.7->yfinance) (1.17.1)
Requirement already satisfied: certifi>=2024.2.2 in ./venv/lib/python3.12/site-packages (from curl_cffi>=0.7->yfinance) (2025.4.26)
Requirement already satisfied: pycparser in ./venv/lib/python3.12/site-packages (from cffi>=1.12.0->curl_cffi>=0.7->yfinance) (2.22)
Requirement already satisfied: python-dateutil>=2.8.2 in ./venv/lib/python3.12/site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in ./venv/lib/python3.12/site-packages (from pandas>=1.3.0->yfinance) (2025.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas>=1.3.0->yfinance) (1.17.0)
Requirement already satisfied: charset-normalizer<4,>=2 in ./venv/lib/python3.12/site-packages (from requests>=2.31->yfinance) (3.4.2)
Requirement already satisfied: idna<4,>=2.5 in ./venv/lib/python3.12/site-packages (from requests>=2.31->yfinance) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in ./venv/lib/python3.12/site-packages (from requests>=2.31->yfinance) (2.4.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import yfinance as yf

In [7]:


ticker = "AAPL"
data = yf.download(ticker,
                   start="2018-01-01", 
                   end="2020-12-31")    

print(data.head())

YF.download() has changed argument auto_adjust default to True

[*********************100%***********************]  1 of 1 completed

Price           Close       High        Low       Open     Volume
Ticker           AAPL       AAPL       AAPL       AAPL       AAPL
Date
2018-01-02  40.426834  40.436224  39.722779  39.933998  102223600
2018-01-03  40.419777  40.964248  40.356415  40.490183  118071600
2018-01-04  40.607533  40.710794  40.384583  40.492536   89738400
2018-01-05  41.069855  41.156687  40.612220  40.703747   94640000
2018-01-08  40.917328  41.213030  40.818757  40.917328   82271200

In [8]:
csv_AAPL = f"{ticker}_AAPL_historical_train_data_spark.csv"
data.to_csv(csv_AAPL)

In [9]:
df_AAPL= pd.read_csv("AAPL_AAPL_historical_train_data_spark.csv")

In [10]:
df_AAPL.head()

,Price,Close,High,Low,Open,Volume
0,Ticker,AAPL,AAPL,AAPL,AAPL,AAPL
1,Date,NaN,NaN,NaN,NaN,NaN
2,2018-01-02,40.42683410644531,40.43622351118219,39.72277915354373,39.93399778801941,102223600
3,2018-01-03,40.419776916503906,40.964247570953226,40.35641457560373,40.490183098511274,118071600
4,2018-01-04,40.6075325012207,40.71079444172855,40.3845825374921,40.49253559819918,89738400

In [11]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import lit

# Parar sessão anterior, se necessário
try:
    spark.stop()
except:
    pass

# Criar nova SparkSession com o caminho exato do JAR
spark = SparkSession.builder \
    .appName("PySpark CSV to MySQL") \
    .master("local") \
    .config("spark.jars", "/usr/local/spark-3.4.4-bin-hadoop3/jars/mysql-connector-j-8.0.33.jar") \
    .getOrCreate()

# Caminho do CSV
file_path = "file:///home/hduser/novo/AAPL_AAPL_historical_train_data_spark.csv"

# Leitura do CSV
df = spark.read.csv(file_path, header=True, inferSchema=True)

# Visualizar as primeiras 5 linhas
df.show(5)

+----------+------------------+------------------+-----------------+------------------+---------+
|     Price|             Close|              High|              Low|              Open|   Volume|
+----------+------------------+------------------+-----------------+------------------+---------+
|    Ticker|              AAPL|              AAPL|             AAPL|              AAPL|     AAPL|
|      Date|              null|              null|             null|              null|     null|
|2018-01-02| 40.42683410644531| 40.43622351118219|39.72277915354373| 39.93399778801941|102223600|
|2018-01-03|40.419776916503906|40.964247570953226|40.35641457560373|40.490183098511274|118071600|
|2018-01-04|  40.6075325012207| 40.71079444172855| 40.3845825374921| 40.49253559819918| 89738400|
+----------+------------------+------------------+-----------------+------------------+---------+
only showing top 5 rows

In [12]:
# print the data type info
df.printSchema()

root
 |-- Price: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [13]:
df.show(5)

+----------+------------------+------------------+-----------------+------------------+---------+
|     Price|             Close|              High|              Low|              Open|   Volume|
+----------+------------------+------------------+-----------------+------------------+---------+
|    Ticker|              AAPL|              AAPL|             AAPL|              AAPL|     AAPL|
|      Date|              null|              null|             null|              null|     null|
|2018-01-02| 40.42683410644531| 40.43622351118219|39.72277915354373| 39.93399778801941|102223600|
|2018-01-03|40.419776916503906|40.964247570953226|40.35641457560373|40.490183098511274|118071600|
|2018-01-04|  40.6075325012207| 40.71079444172855| 40.3845825374921| 40.49253559819918| 89738400|
+----------+------------------+------------------+-----------------+------------------+---------+
only showing top 5 rows

In [14]:
# Remove the first two lines (CRL and null)
df = df.filter(df.Price != "Ticker").filter(df.Price != "Date")

In [15]:
df = df.toDF("Date", "Close", "High", "Low", "Open", "Volume")

In [16]:


df.show(5)

+----------+------------------+------------------+------------------+------------------+---------+
|      Date|             Close|              High|               Low|              Open|   Volume|
+----------+------------------+------------------+------------------+------------------+---------+
|2018-01-02| 40.42683410644531| 40.43622351118219| 39.72277915354373| 39.93399778801941|102223600|
|2018-01-03|40.419776916503906|40.964247570953226| 40.35641457560373|40.490183098511274|118071600|
|2018-01-04|  40.6075325012207| 40.71079444172855|  40.3845825374921| 40.49253559819918| 89738400|
|2018-01-05|41.069854736328125|41.156686997562645|40.612219928324755|40.703746889925426| 94640000|
|2018-01-08|40.917327880859375| 41.21302966783653| 40.81875703752503|40.917327880859375| 82271200|
+----------+------------------+------------------+------------------+------------------+---------+
only showing top 5 rows

In [17]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [18]:


# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [19]:
# convert string double
df = df.withColumn("Close", col("Close").cast("double"))

In [20]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [21]:


df = df.withColumn("High", col("High").cast("double"))
df = df.withColumn("Low", col("Low").cast("double"))
df = df.withColumn("Open", col("Open").cast("double"))
df = df.withColumn("Volume", col("Volume").cast("double"))
df = df.withColumn("Date", col("Date").cast("Date"))

In [22]:


df.printSchema()

root
 |-- Date: date (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: double (nullable = true)
 |-- Low: double (nullable = true)
 |-- Open: double (nullable = true)
 |-- Volume: double (nullable = true)

In [23]:
import mysql.connector
print(mysql.connector.__version__)

9.3.0

In [24]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+----------+
|      Date|             Close|              High|               Low|              Open|    Volume|
+----------+------------------+------------------+------------------+------------------+----------+
|2018-01-02| 40.42683410644531| 40.43622351118219| 39.72277915354373| 39.93399778801941|1.022236E8|
|2018-01-03|40.419776916503906|40.964247570953226| 40.35641457560373|40.490183098511274|1.180716E8|
|2018-01-04|  40.6075325012207| 40.71079444172855|  40.3845825374921| 40.49253559819918| 8.97384E7|
|2018-01-05|41.069854736328125|41.156686997562645|40.612219928324755|40.703746889925426|   9.464E7|
|2018-01-08|40.917327880859375| 41.21302966783653| 40.81875703752503|40.917327880859375| 8.22712E7|
+----------+------------------+------------------+------------------+------------------+----------+
only showing top 5 rows

In [25]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [26]:
# MySQL connection properties
url = "jdbc:mysql://localhost:3306/companies"  # MySQL URL
properties = {
    "user": "root",
    "password": "password",
    "driver": "com.mysql.cj.jdbc.Driver"
}

In [27]:
# Leitura do CSV
#df = spark.read.csv(file_path, header=True, inferSchema=True)

# Adiciona a coluna 'nome' com valor fixo "AAPL"
df_comp_nome = df.withColumn("nome", lit("AAPL"))

# Escreve no banco MySQL
df_comp_nome.write \
    .format("jdbc") \
    .option("url", "jdbc:mysql://localhost:3306/companies") \
    .option("driver", "com.mysql.cj.jdbc.Driver") \
    .option("dbtable", "AAPL_historico") \
    .option("user", "root") \
    .option("password", "password") \
    .mode("overwrite") \
    .save()

In [28]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

mySQL

In [29]:
#pip install pymysql

In [30]:
import pandas as pd
import pymysql

conn = pymysql.connect(
    host='localhost',
    user='root',
    password='password',
    database='companies'
)

df = pd.read_sql("SELECT * FROM AAPL_historico", conn)
df.to_csv("AAPL_historico_MYsql.csv", index=False)

/tmp/ipykernel_2904/971793236.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM AAPL_historico", conn)

In [31]:
df_AAPL_Mysql= pd.read_csv("AAPL_historico_MYsql.csv")

In [32]:
df_AAPL_Mysql.head()

         Date      Close       High        Low       Open       Volume  nome
0  2018-01-02  40.426834  40.436224  39.722779  39.933998  102223600.0  AAPL
1  2018-01-03  40.419777  40.964248  40.356415  40.490183  118071600.0  AAPL
2  2018-01-04  40.607533  40.710794  40.384583  40.492536   89738400.0  AAPL
3  2018-01-05  41.069855  41.156687  40.612220  40.703747   94640000.0  AAPL
4  2018-01-08  40.917328  41.213030  40.818757  40.917328   82271200.0  AAPL

# ABNB

In [33]:
ticker = "ABNB"
data = yf.download(ticker,
                   start="2018-01-01", 
                   end="2020-12-31")    

print(data.head())

[*********************100%***********************]  1 of 1 completed

Price            Close        High         Low        Open    Volume
Ticker            ABNB        ABNB        ABNB        ABNB      ABNB
Date
2020-12-10  144.710007  165.000000  141.250000  146.000000  70447500
2020-12-11  139.250000  151.500000  135.100006  146.550003  26980800
2020-12-14  130.000000  135.300003  125.160004  135.000000  16966100
2020-12-15  124.800003  127.599998  121.500000  126.690002  10914400
2020-12-16  137.990005  142.000000  124.910004  125.830002  20409600

In [34]:
csv_ABNB = f"{ticker}_ABNB_historical_train_data_spark.csv"
data.to_csv(csv_ABNB)

In [35]:
df_ABNB= pd.read_csv("ABNB_ABNB_historical_train_data_spark.csv")

In [36]:
df_ABNB.head()

,Price,Close,High,Low,Open,Volume
0,Ticker,ABNB,ABNB,ABNB,ABNB,ABNB
1,Date,NaN,NaN,NaN,NaN,NaN
2,2020-12-10,144.7100067138672,165.0,141.25,146.0,70447500
3,2020-12-11,139.25,151.5,135.10000610351562,146.5500030517578,26980800
4,2020-12-14,130.0,135.3000030517578,125.16000366210938,135.0,16966100

In [37]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import lit

# Parar sessão anterior, se necessário
try:
    spark.stop()
except:
    pass

# Criar nova SparkSession com o caminho exato do JAR
spark = SparkSession.builder \
    .appName("PySpark CSV to MySQL") \
    .master("local") \
    .config("spark.jars", "/usr/local/spark-3.4.4-bin-hadoop3/jars/mysql-connector-j-8.0.33.jar") \
    .getOrCreate()

# Caminho do CSV
file_path = "file:///home/hduser/novo/ABNB_ABNB_historical_train_data_spark.csv"

# Leitura do CSV
df = spark.read.csv(file_path, header=True, inferSchema=True)

# Visualizar as primeiras 5 linhas
df.show(5)

+----------+-----------------+-----------------+------------------+-----------------+--------+
|     Price|            Close|             High|               Low|             Open|  Volume|
+----------+-----------------+-----------------+------------------+-----------------+--------+
|    Ticker|             ABNB|             ABNB|              ABNB|             ABNB|    ABNB|
|      Date|             null|             null|              null|             null|    null|
|2020-12-10|144.7100067138672|            165.0|            141.25|            146.0|70447500|
|2020-12-11|           139.25|            151.5|135.10000610351562|146.5500030517578|26980800|
|2020-12-14|            130.0|135.3000030517578|125.16000366210938|            135.0|16966100|
+----------+-----------------+-----------------+------------------+-----------------+--------+
only showing top 5 rows

In [38]:
# print the data type info
df.printSchema()

root
 |-- Price: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [39]:
df.show(5)

+----------+-----------------+-----------------+------------------+-----------------+--------+
|     Price|            Close|             High|               Low|             Open|  Volume|
+----------+-----------------+-----------------+------------------+-----------------+--------+
|    Ticker|             ABNB|             ABNB|              ABNB|             ABNB|    ABNB|
|      Date|             null|             null|              null|             null|    null|
|2020-12-10|144.7100067138672|            165.0|            141.25|            146.0|70447500|
|2020-12-11|           139.25|            151.5|135.10000610351562|146.5500030517578|26980800|
|2020-12-14|            130.0|135.3000030517578|125.16000366210938|            135.0|16966100|
+----------+-----------------+-----------------+------------------+-----------------+--------+
only showing top 5 rows

In [40]:
# Remove the first two lines (CRL and null)
df = df.filter(df.Price != "Ticker").filter(df.Price != "Date")

In [41]:
df = df.toDF("Date", "Close", "High", "Low", "Open", "Volume")

In [42]:

df.show(5)

+----------+------------------+-----------------+------------------+------------------+--------+
|      Date|             Close|             High|               Low|              Open|  Volume|
+----------+------------------+-----------------+------------------+------------------+--------+
|2020-12-10| 144.7100067138672|            165.0|            141.25|             146.0|70447500|
|2020-12-11|            139.25|            151.5|135.10000610351562| 146.5500030517578|26980800|
|2020-12-14|             130.0|135.3000030517578|125.16000366210938|             135.0|16966100|
|2020-12-15|124.80000305175781|127.5999984741211|             121.5|126.69000244140625|10914400|
|2020-12-16|137.99000549316406|            142.0|124.91000366210938|125.83000183105469|20409600|
+----------+------------------+-----------------+------------------+------------------+--------+
only showing top 5 rows

In [43]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [44]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [45]:
# convert string double
df = df.withColumn("Close", col("Close").cast("double"))

In [46]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [47]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [48]:
import mysql.connector
print(mysql.connector.__version__)

9.3.0

In [49]:
df.show(5)

+----------+------------------+-----------------+------------------+------------------+--------+
|      Date|             Close|             High|               Low|              Open|  Volume|
+----------+------------------+-----------------+------------------+------------------+--------+
|2020-12-10| 144.7100067138672|            165.0|            141.25|             146.0|70447500|
|2020-12-11|            139.25|            151.5|135.10000610351562| 146.5500030517578|26980800|
|2020-12-14|             130.0|135.3000030517578|125.16000366210938|             135.0|16966100|
|2020-12-15|124.80000305175781|127.5999984741211|             121.5|126.69000244140625|10914400|
|2020-12-16|137.99000549316406|            142.0|124.91000366210938|125.83000183105469|20409600|
+----------+------------------+-----------------+------------------+------------------+--------+
only showing top 5 rows

In [50]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [51]:
# MySQL connection properties
url = "jdbc:mysql://localhost:3306/companies"  # MySQL URL
properties = {
    "user": "root",
    "password": "password",
    "driver": "com.mysql.cj.jdbc.Driver"
}

In [53]:
# Leitura do CSV
#df = spark.read.csv(file_path, header=True, inferSchema=True)

# Adiciona a coluna 'nome' com valor fixo "AAPL"
df_comp_nome = df.withColumn("nome", lit("ABNB"))

# Escreve no banco MySQL
df_comp_nome.write \
    .format("jdbc") \
    .option("url", "jdbc:mysql://localhost:3306/companies") \
    .option("driver", "com.mysql.cj.jdbc.Driver") \
    .option("dbtable", "ABNB_historico") \
    .option("user", "root") \
    .option("password", "password") \
    .mode("overwrite") \
    .save()

In [54]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

## mySQL

In [55]:
import pandas as pd
import pymysql

conn = pymysql.connect(
    host='localhost',
    user='root',
    password='password',
    database='companies'
)

df = pd.read_sql("SELECT * FROM ABNB_historico", conn)
df.to_csv("ABNB_historico_MYsql.csv", index=False)

/tmp/ipykernel_2904/3451849036.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM ABNB_historico", conn)

In [56]:
df_ABNB_Mysql= pd.read_csv("ABNB_historico_MYsql.csv")

In [57]:
df_ABNB_Mysql.head()

         Date       Close        High         Low        Open    Volume  nome
0  2020-12-10  144.710007  165.000000  141.250000  146.000000  70447500  ABNB
1  2020-12-11  139.250000  151.500000  135.100006  146.550003  26980800  ABNB
2  2020-12-14  130.000000  135.300003  125.160004  135.000000  16966100  ABNB
3  2020-12-15  124.800003  127.599998  121.500000  126.690002  10914400  ABNB
4  2020-12-16  137.990005  142.000000  124.910004  125.830002  20409600  ABNB

# AMT

In [58]:

ticker = "AMT"
data = yf.download(ticker,
                   start="2018-01-01", 
                   end="2020-12-31")    

print(data.head())

[*********************100%***********************]  1 of 1 completed

Price            Close        High         Low        Open   Volume
Ticker             AMT         AMT         AMT         AMT      AMT
Date
2018-01-02  118.035645  119.783636  117.851644  119.733457  1880600
2018-01-03  118.495644  119.181466  117.809834  117.968745  1770500
2018-01-04  116.764366  118.729820  116.739276  118.294908  1729600
2018-01-05  117.517075  117.675985  116.747624  117.282895  2119400
2018-01-08  118.771637  119.800370  117.642557  117.642557  1882100

In [59]:
csv_AMT = f"{ticker}_AMT_historical_train_data_spark.csv"
data.to_csv(csv_AMT)

In [60]:
df_AMT= pd.read_csv("AMT_AMT_historical_train_data_spark.csv")

In [61]:
df_AMT.head()

,Price,Close,High,Low,Open,Volume
0,Ticker,AMT,AMT,AMT,AMT,AMT
1,Date,NaN,NaN,NaN,NaN,NaN
2,2018-01-02,118.03564453125,119.78363614377574,117.85164407078862,119.73345652035125,1880600
3,2018-01-03,118.49564361572266,119.18146589604466,117.80983409725926,117.96874476035136,1770500
4,2018-01-04,116.76436614990234,118.72981971286907,116.7392763394693,118.29490839560174,1729600

In [62]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import lit

# Parar sessão anterior, se necessário
try:
    spark.stop()
except:
    pass

# Criar nova SparkSession com o caminho exato do JAR
spark = SparkSession.builder \
    .appName("PySpark CSV to MySQL") \
    .master("local") \
    .config("spark.jars", "/usr/local/spark-3.4.4-bin-hadoop3/jars/mysql-connector-j-8.0.33.jar") \
    .getOrCreate()

# Caminho do CSV
file_path = "file:///home/hduser/novo/AMT_AMT_historical_train_data_spark.csv"

# Leitura do CSV
df = spark.read.csv(file_path, header=True, inferSchema=True)

# Visualizar as primeiras 5 linhas
df.show(5)

+----------+------------------+------------------+------------------+------------------+-------+
|     Price|             Close|              High|               Low|              Open| Volume|
+----------+------------------+------------------+------------------+------------------+-------+
|    Ticker|               AMT|               AMT|               AMT|               AMT|    AMT|
|      Date|              null|              null|              null|              null|   null|
|2018-01-02|   118.03564453125|119.78363614377574|117.85164407078862|119.73345652035125|1880600|
|2018-01-03|118.49564361572266|119.18146589604466|117.80983409725926|117.96874476035136|1770500|
|2018-01-04|116.76436614990234|118.72981971286907| 116.7392763394693|118.29490839560174|1729600|
+----------+------------------+------------------+------------------+------------------+-------+
only showing top 5 rows

In [63]:
# print the data type info
df.printSchema()

root
 |-- Price: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [64]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+-------+
|     Price|             Close|              High|               Low|              Open| Volume|
+----------+------------------+------------------+------------------+------------------+-------+
|    Ticker|               AMT|               AMT|               AMT|               AMT|    AMT|
|      Date|              null|              null|              null|              null|   null|
|2018-01-02|   118.03564453125|119.78363614377574|117.85164407078862|119.73345652035125|1880600|
|2018-01-03|118.49564361572266|119.18146589604466|117.80983409725926|117.96874476035136|1770500|
|2018-01-04|116.76436614990234|118.72981971286907| 116.7392763394693|118.29490839560174|1729600|
+----------+------------------+------------------+------------------+------------------+-------+
only showing top 5 rows

In [65]:
# Remove the first two lines (CRL and null)
df = df.filter(df.Price != "Ticker").filter(df.Price != "Date")

In [66]:
df = df.toDF("Date", "Close", "High", "Low", "Open", "Volume")

In [67]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+-------+
|      Date|             Close|              High|               Low|              Open| Volume|
+----------+------------------+------------------+------------------+------------------+-------+
|2018-01-02|   118.03564453125|119.78363614377574|117.85164407078862|119.73345652035125|1880600|
|2018-01-03|118.49564361572266|119.18146589604466|117.80983409725926|117.96874476035136|1770500|
|2018-01-04|116.76436614990234|118.72981971286907| 116.7392763394693|118.29490839560174|1729600|
|2018-01-05|117.51707458496094|117.67598521019036|116.74762402866821|117.28289453573514|2119400|
|2018-01-08|118.77163696289062|119.80037031955236|117.64255711840566|117.64255711840566|1882100|
+----------+------------------+------------------+------------------+------------------+-------+
only showing top 5 rows

In [68]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [69]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [70]:
# convert string double
df = df.withColumn("Close", col("Close").cast("double"))

In [71]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [72]:
df = df.withColumn("High", col("High").cast("double"))
df = df.withColumn("Low", col("Low").cast("double"))
df = df.withColumn("Open", col("Open").cast("double"))
df = df.withColumn("Volume", col("Volume").cast("double"))
df = df.withColumn("Date", col("Date").cast("Date"))

In [73]:
df.printSchema()

root
 |-- Date: date (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: double (nullable = true)
 |-- Low: double (nullable = true)
 |-- Open: double (nullable = true)
 |-- Volume: double (nullable = true)

In [74]:
import mysql.connector
print(mysql.connector.__version__)

9.3.0

In [75]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+---------+
|      Date|             Close|              High|               Low|              Open|   Volume|
+----------+------------------+------------------+------------------+------------------+---------+
|2018-01-02|   118.03564453125|119.78363614377574|117.85164407078862|119.73345652035125|1880600.0|
|2018-01-03|118.49564361572266|119.18146589604466|117.80983409725926|117.96874476035136|1770500.0|
|2018-01-04|116.76436614990234|118.72981971286907| 116.7392763394693|118.29490839560174|1729600.0|
|2018-01-05|117.51707458496094|117.67598521019036|116.74762402866821|117.28289453573514|2119400.0|
|2018-01-08|118.77163696289062|119.80037031955236|117.64255711840566|117.64255711840566|1882100.0|
+----------+------------------+------------------+------------------+------------------+---------+
only showing top 5 rows

In [76]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [77]:
# MySQL connection properties
url = "jdbc:mysql://localhost:3306/companies"  # MySQL URL
properties = {
    "user": "root",
    "password": "password",
    "driver": "com.mysql.cj.jdbc.Driver"
}

In [78]:
# Leitura do CSV
#df = spark.read.csv(file_path, header=True, inferSchema=True)

# Adiciona a coluna 'nome' com valor fixo "AAPL"
df_comp_nome = df.withColumn("nome", lit("AMT"))

# Escreve no banco MySQL
df_comp_nome.write \
    .format("jdbc") \
    .option("url", "jdbc:mysql://localhost:3306/companies") \
    .option("driver", "com.mysql.cj.jdbc.Driver") \
    .option("dbtable", "AMT_historico") \
    .option("user", "root") \
    .option("password", "password") \
    .mode("overwrite") \
    .save()

In [79]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

### mySQL

In [80]:
import pandas as pd
import pymysql

conn = pymysql.connect(
    host='localhost',
    user='root',
    password='password',
    database='companies'
)

df = pd.read_sql("SELECT * FROM AMT_historico", conn)
df.to_csv("AMT_historico_MYsql.csv", index=False)

/tmp/ipykernel_2904/2382641269.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM AMT_historico", conn)

In [81]:
df_AMT_Mysql= pd.read_csv("AMT_historico_MYsql.csv")

In [82]:
df_AMT_Mysql.head()

         Date       Close        High         Low        Open     Volume nome
0  2018-01-02  118.035645  119.783636  117.851644  119.733457  1880600.0  AMT
1  2018-01-03  118.495644  119.181466  117.809834  117.968745  1770500.0  AMT
2  2018-01-04  116.764366  118.729820  116.739276  118.294908  1729600.0  AMT
3  2018-01-05  117.517075  117.675985  116.747624  117.282895  2119400.0  AMT
4  2018-01-08  118.771637  119.800370  117.642557  117.642557  1882100.0  AMT

# AMZN

In [83]:


ticker = "AMZN"
data = yf.download(ticker,
                   start="2018-01-01", 
                   end="2020-12-31")    

print(data.head())

[*********************100%***********************]  1 of 1 completed

Price           Close       High        Low       Open    Volume
Ticker           AMZN       AMZN       AMZN       AMZN      AMZN
Date
2018-01-02  59.450500  59.500000  58.525501  58.599998  53890000
2018-01-03  60.209999  60.274502  59.415001  59.415001  62176000
2018-01-04  60.479500  60.793499  60.233002  60.250000  60442000
2018-01-05  61.457001  61.457001  60.500000  60.875500  70894000
2018-01-08  62.343498  62.653999  61.601501  61.799999  85590000

In [84]:
csv_AMZN = f"{ticker}_AMZN_historical_train_data_spark.csv"
data.to_csv(csv_AMZN)

In [85]:
df_AMZN= pd.read_csv("AMZN_AMZN_historical_train_data_spark.csv")

In [86]:
df_AMZN.head()

,Price,Close,High,Low,Open,Volume
0,Ticker,AMZN,AMZN,AMZN,AMZN,AMZN
1,Date,NaN,NaN,NaN,NaN,NaN
2,2018-01-02,59.45050048828125,59.5,58.5255012512207,58.599998474121094,53890000
3,2018-01-03,60.209999084472656,60.27450180053711,59.415000915527344,59.415000915527344,62176000
4,2018-01-04,60.47949981689453,60.79349899291992,60.233001708984375,60.25,60442000

In [87]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import lit

# Parar sessão anterior, se necessário
try:
    spark.stop()
except:
    pass

# Criar nova SparkSession com o caminho exato do JAR
spark = SparkSession.builder \
    .appName("PySpark CSV to MySQL") \
    .master("local") \
    .config("spark.jars", "/usr/local/spark-3.4.4-bin-hadoop3/jars/mysql-connector-j-8.0.33.jar") \
    .getOrCreate()

# Caminho do CSV
file_path = "file:///home/hduser/novo/AMZN_AMZN_historical_train_data_spark.csv"

# Leitura do CSV
df = spark.read.csv(file_path, header=True, inferSchema=True)

# Visualizar as primeiras 5 linhas
df.show(5)

+----------+------------------+-----------------+------------------+------------------+--------+
|     Price|             Close|             High|               Low|              Open|  Volume|
+----------+------------------+-----------------+------------------+------------------+--------+
|    Ticker|              AMZN|             AMZN|              AMZN|              AMZN|    AMZN|
|      Date|              null|             null|              null|              null|    null|
|2018-01-02| 59.45050048828125|             59.5|  58.5255012512207|58.599998474121094|53890000|
|2018-01-03|60.209999084472656|60.27450180053711|59.415000915527344|59.415000915527344|62176000|
|2018-01-04| 60.47949981689453|60.79349899291992|60.233001708984375|             60.25|60442000|
+----------+------------------+-----------------+------------------+------------------+--------+
only showing top 5 rows

In [88]:
# print the data type info
df.printSchema()

root
 |-- Price: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [89]:
df.show(5)

+----------+------------------+-----------------+------------------+------------------+--------+
|     Price|             Close|             High|               Low|              Open|  Volume|
+----------+------------------+-----------------+------------------+------------------+--------+
|    Ticker|              AMZN|             AMZN|              AMZN|              AMZN|    AMZN|
|      Date|              null|             null|              null|              null|    null|
|2018-01-02| 59.45050048828125|             59.5|  58.5255012512207|58.599998474121094|53890000|
|2018-01-03|60.209999084472656|60.27450180053711|59.415000915527344|59.415000915527344|62176000|
|2018-01-04| 60.47949981689453|60.79349899291992|60.233001708984375|             60.25|60442000|
+----------+------------------+-----------------+------------------+------------------+--------+
only showing top 5 rows

In [90]:
# Remove the first two lines (CRL and null)
df = df.filter(df.Price != "Ticker").filter(df.Price != "Date")

In [91]:
df = df.toDF("Date", "Close", "High", "Low", "Open", "Volume")

In [92]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+--------+
|      Date|             Close|              High|               Low|              Open|  Volume|
+----------+------------------+------------------+------------------+------------------+--------+
|2018-01-02| 59.45050048828125|              59.5|  58.5255012512207|58.599998474121094|53890000|
|2018-01-03|60.209999084472656| 60.27450180053711|59.415000915527344|59.415000915527344|62176000|
|2018-01-04| 60.47949981689453| 60.79349899291992|60.233001708984375|             60.25|60442000|
|2018-01-05|61.457000732421875|61.457000732421875|              60.5|  60.8754997253418|70894000|
|2018-01-08| 62.34349822998047| 62.65399932861328| 61.60150146484375| 61.79999923706055|85590000|
+----------+------------------+------------------+------------------+------------------+--------+
only showing top 5 rows

In [93]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [94]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [95]:
# convert string double
df = df.withColumn("Close", col("Close").cast("double"))

In [96]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [97]:
df = df.withColumn("High", col("High").cast("double"))
df = df.withColumn("Low", col("Low").cast("double"))
df = df.withColumn("Open", col("Open").cast("double"))
df = df.withColumn("Volume", col("Volume").cast("double"))
df = df.withColumn("Date", col("Date").cast("Date"))

In [98]:

df.printSchema()

root
 |-- Date: date (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: double (nullable = true)
 |-- Low: double (nullable = true)
 |-- Open: double (nullable = true)
 |-- Volume: double (nullable = true)

In [99]:
import mysql.connector
print(mysql.connector.__version__)

9.3.0

In [100]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+--------+
|      Date|             Close|              High|               Low|              Open|  Volume|
+----------+------------------+------------------+------------------+------------------+--------+
|2018-01-02| 59.45050048828125|              59.5|  58.5255012512207|58.599998474121094| 5.389E7|
|2018-01-03|60.209999084472656| 60.27450180053711|59.415000915527344|59.415000915527344|6.2176E7|
|2018-01-04| 60.47949981689453| 60.79349899291992|60.233001708984375|             60.25|6.0442E7|
|2018-01-05|61.457000732421875|61.457000732421875|              60.5|  60.8754997253418|7.0894E7|
|2018-01-08| 62.34349822998047| 62.65399932861328| 61.60150146484375| 61.79999923706055| 8.559E7|
+----------+------------------+------------------+------------------+------------------+--------+
only showing top 5 rows

In [101]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [102]:
# MySQL connection properties
url = "jdbc:mysql://localhost:3306/companies"  # MySQL URL
properties = {
    "user": "root",
    "password": "password",
    "driver": "com.mysql.cj.jdbc.Driver"
}

In [103]:
# Leitura do CSV
#df = spark.read.csv(file_path, header=True, inferSchema=True)

# Adiciona a coluna 'nome' com valor fixo "AAPL"
df_comp_nome = df.withColumn("nome", lit("AAPL"))

# Escreve no banco MySQL
df_comp_nome.write \
    .format("jdbc") \
    .option("url", "jdbc:mysql://localhost:3306/companies") \
    .option("driver", "com.mysql.cj.jdbc.Driver") \
    .option("dbtable", "AAPL_historico") \
    .option("user", "root") \
    .option("password", "password") \
    .mode("overwrite") \
    .save()

In [104]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [105]:
import pandas as pd
import pymysql

conn = pymysql.connect(
    host='localhost',
    user='root',
    password='password',
    database='companies'
)

df = pd.read_sql("SELECT * FROM AMZN_historico", conn)
df.to_csv("AMZN_historico_MYsql.csv", index=False)

/tmp/ipykernel_2904/2508196468.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM AMZN_historico", conn)

In [106]:
df_AMZN_Mysql= pd.read_csv("AMZN_historico_MYsql.csv")

In [107]:
df_AMZN_Mysql.head()

         Date      Close       High        Low       Open      Volume  nome
0  2018-01-02  59.450500  59.500000  58.525501  58.599998  53890000.0  AMZN
1  2018-01-03  60.209999  60.274502  59.415001  59.415001  62176000.0  AMZN
2  2018-01-04  60.479500  60.793499  60.233002  60.250000  60442000.0  AMZN
3  2018-01-05  61.457001  61.457001  60.500000  60.875500  70894000.0  AMZN
4  2018-01-08  62.343498  62.653999  61.601501  61.799999  85590000.0  AMZN

# BA

In [108]:
ticker = "BA"
data = yf.download(ticker,
                   start="2018-01-01", 
                   end="2020-12-31")    

print(data.head())

[*********************100%***********************]  1 of 1 completed

Price            Close        High         Low        Open   Volume
Ticker              BA          BA          BA          BA       BA
Date
2018-01-02  282.886383  283.029326  281.514071  281.847624  2978900
2018-01-03  283.801300  284.468407  281.580839  282.028747  3211200
2018-01-04  282.724426  284.392164  281.580823  283.934717  4171700
2018-01-05  294.322296  294.369963  282.772028  282.819666  6177700
2018-01-08  295.570709  296.247326  291.377547  294.150759  4124900

In [109]:
csv_BA = f"{ticker}_BA_historical_train_data_spark.csv"
data.to_csv(csv_BA)

In [110]:
df_BA= pd.read_csv("BA_BA_historical_train_data_spark.csv")

In [111]:
Df_BA.head()

NameError: name 'Df_BA' is not defined

In [112]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import lit

# Parar sessão anterior, se necessário
try:
    spark.stop()
except:
    pass

# SparkSession
spark = SparkSession.builder \
    .appName("PySpark CSV to MySQL") \
    .master("local") \
    .config("spark.jars", "/usr/local/spark-3.4.4-bin-hadoop3/jars/mysql-connector-j-8.0.33.jar") \
    .getOrCreate()

# CSV PATH
file_path = "file:///home/hduser/novo/BA_BA_historical_train_data_spark.csv"

# READING OF THE CSV
df = spark.read.csv(file_path, header=True, inferSchema=True)


df.show(5)

+----------+------------------+------------------+------------------+------------------+-------+
|     Price|             Close|              High|               Low|              Open| Volume|
+----------+------------------+------------------+------------------+------------------+-------+
|    Ticker|                BA|                BA|                BA|                BA|     BA|
|      Date|              null|              null|              null|              null|   null|
|2018-01-02| 282.8863830566406| 283.0293261619516|   281.51407107959| 281.8476243806707|2978900|
|2018-01-03| 283.8013000488281|284.46840677330397|281.58083918445425|282.02874705190794|3211200|
|2018-01-04|282.72442626953125|284.39216390251653| 281.5808231165554| 283.9347168247189|4171700|
+----------+------------------+------------------+------------------+------------------+-------+
only showing top 5 rows

In [113]:
# print the data type info
df.printSchema()

root
 |-- Price: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [114]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+-------+
|     Price|             Close|              High|               Low|              Open| Volume|
+----------+------------------+------------------+------------------+------------------+-------+
|    Ticker|                BA|                BA|                BA|                BA|     BA|
|      Date|              null|              null|              null|              null|   null|
|2018-01-02| 282.8863830566406| 283.0293261619516|   281.51407107959| 281.8476243806707|2978900|
|2018-01-03| 283.8013000488281|284.46840677330397|281.58083918445425|282.02874705190794|3211200|
|2018-01-04|282.72442626953125|284.39216390251653| 281.5808231165554| 283.9347168247189|4171700|
+----------+------------------+------------------+------------------+------------------+-------+
only showing top 5 rows

In [115]:
# Remove the first two lines (CRL and null)
df = df.filter(df.Price != "Ticker").filter(df.Price != "Date")

In [116]:
df = df.toDF("Date", "Close", "High", "Low", "Open", "Volume")

In [117]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+-------+
|      Date|             Close|              High|               Low|              Open| Volume|
+----------+------------------+------------------+------------------+------------------+-------+
|2018-01-02| 282.8863830566406| 283.0293261619516|   281.51407107959| 281.8476243806707|2978900|
|2018-01-03| 283.8013000488281|284.46840677330397|281.58083918445425|282.02874705190794|3211200|
|2018-01-04|282.72442626953125|284.39216390251653| 281.5808231165554| 283.9347168247189|4171700|
|2018-01-05| 294.3222961425781|294.36996323292874|  282.772027931123|282.81966593844106|6177700|
|2018-01-08| 295.5707092285156| 296.2473259689747|291.37754675172033|294.15075927209307|4124900|
+----------+------------------+------------------+------------------+------------------+-------+
only showing top 5 rows

In [118]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: string (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [119]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [120]:
# convert string double
df = df.withColumn("Close", col("Close").cast("double"))

In [121]:
df.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: string (nullable = true)
 |-- Low: string (nullable = true)
 |-- Open: string (nullable = true)
 |-- Volume: string (nullable = true)

In [122]:
df = df.withColumn("High", col("High").cast("double"))
df = df.withColumn("Low", col("Low").cast("double"))
df = df.withColumn("Open", col("Open").cast("double"))
df = df.withColumn("Volume", col("Volume").cast("double"))
df = df.withColumn("Date", col("Date").cast("Date"))

In [123]:
df.printSchema()

root
 |-- Date: date (nullable = true)
 |-- Close: double (nullable = true)
 |-- High: double (nullable = true)
 |-- Low: double (nullable = true)
 |-- Open: double (nullable = true)
 |-- Volume: double (nullable = true)

In [124]:
import mysql.connector
print(mysql.connector.__version__)

9.3.0

In [125]:
df.show(5)

+----------+------------------+------------------+------------------+------------------+---------+
|      Date|             Close|              High|               Low|              Open|   Volume|
+----------+------------------+------------------+------------------+------------------+---------+
|2018-01-02| 282.8863830566406| 283.0293261619516|   281.51407107959| 281.8476243806707|2978900.0|
|2018-01-03| 283.8013000488281|284.46840677330397|281.58083918445425|282.02874705190794|3211200.0|
|2018-01-04|282.72442626953125|284.39216390251653| 281.5808231165554| 283.9347168247189|4171700.0|
|2018-01-05| 294.3222961425781|294.36996323292874|  282.772027931123|282.81966593844106|6177700.0|
|2018-01-08| 295.5707092285156| 296.2473259689747|291.37754675172033|294.15075927209307|4124900.0|
+----------+------------------+------------------+------------------+------------------+---------+
only showing top 5 rows

In [126]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [127]:
# MySQL connection
url = "jdbc:mysql://localhost:3306/companies"  # MySQL URL
properties = {
    "user": "root",
    "password": "password",
    "driver": "com.mysql.cj.jdbc.Driver"
}

In [128]:
df_comp_nome = df.withColumn("nome", lit("BA"))

# WRITE IN  MySQL
df_comp_nome.write \
    .format("jdbc") \
    .option("url", "jdbc:mysql://localhost:3306/companies") \
    .option("driver", "com.mysql.cj.jdbc.Driver") \
    .option("dbtable", "BA_historico") \
    .option("user", "root") \
    .option("password", "password") \
    .mode("overwrite") \
    .save()

In [129]:
# # Count Number of nulls in all Column
from pyspark.sql.functions import col, sum

df.select([sum(col(c).isNull().cast("int")).alias(c) for c in df.columns]).show()

+----+-----+----+---+----+------+
|Date|Close|High|Low|Open|Volume|
+----+-----+----+---+----+------+
|   0|    0|   0|  0|   0|     0|
+----+-----+----+---+----+------+

In [130]:
## mySQL

In [131]:
import pandas as pd
import pymysql

conn = pymysql.connect(
    host='localhost',
    user='root',
    password='password',
    database='companies'
)

df = pd.read_sql("SELECT * FROM BA_historico", conn)
df.to_csv("BA_historico_MYsql.csv", index=False)

/tmp/ipykernel_2904/3862318621.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM BA_historico", conn)

In [ ]:
df_BA_Mysql= pd.read_csv("ABNB_historico_MYsql.csv")